In [1]:
import pandas as pd

In [5]:
from io import StringIO

In [6]:
data = '''
Sample Animal Intelligence
1 Dog Smart
2 Dog Smart
3 Cat Dumb
4 Cat Dumb
5 Dog Dumb
6 Cat Smart
'''

In [7]:
df = pd.read_table(StringIO(data),sep='\s+')

In [8]:
df

   Sample Animal Intelligence
0       1    Dog        Smart
1       2    Dog        Smart
2       3    Cat         Dumb
3       4    Cat         Dumb
4       5    Dog         Dumb
5       6    Cat        Smart

In [12]:
pd.crosstab(df.Animal,df.Intelligence,margins=True)

Intelligence  Dumb  Smart  All
Animal
Cat              2      1    3
Dog              1      2    3
All              3      3    6

In [22]:
d = df.groupby(['Animal','Intelligence'])
d.count()

                     Sample
Animal Intelligence
Cat    Dumb               2
       Smart              1
Dog    Dumb               1
       Smart              2